In [502]:
import pandas as pd
import numpy as np
import os
from pydataset import data
from env import get_connection


# import splitting and imputing functions
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

In [503]:
df_iris = data('iris')
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [504]:
df_iris.shape

(150, 5)

In [505]:
df_iris.columns.tolist()

['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width', 'Species']

In [506]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [507]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [508]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')
df_google = pd.read_csv(csv_export_url)

In [509]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [510]:
df_google.shape

(891, 12)

In [511]:
df_google.columns.tolist()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [512]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [513]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [514]:
df_excel_sample = df_google.head(100)

In [515]:
df_google.shape

(891, 12)

In [516]:

df_google.shape[0]

891

In [517]:
len(df_google.index)

891

In [518]:
df_google[df_google.columns[0]].count()

891

In [519]:
df_excel_sample.columns[:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

In [520]:
df_excel_sample.columns[df_excel_sample.dtypes == object]

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [521]:
df_excel_sample_range = df_excel_sample[['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']].max() - df_excel_sample[['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']].min()
df_excel_sample_range

PassengerId     99.000
Survived         1.000
Pclass           2.000
Age             70.170
SibSp            5.000
Parch            5.000
Fare           255.775
dtype: float64

In [522]:
import acquire

In [523]:
iris_df = acquire.get_iris_data()

In [524]:
iris_df.head()

,species_id,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,1,5.1,3.5,1.4,0.2
1,1,setosa,2,4.9,3.0,1.4,0.2
2,1,setosa,3,4.7,3.2,1.3,0.2
3,1,setosa,4,4.6,3.1,1.5,0.2
4,1,setosa,5,5.0,3.6,1.4,0.2

In [525]:
iris_df.shape

(150, 7)

In [526]:
iris_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   species_id      150 non-null    int64
 1   species_name    150 non-null    object
 2   measurement_id  150 non-null    int64
 3   sepal_length    150 non-null    float64
 4   sepal_width     150 non-null    float64
 5   petal_length    150 non-null    float64
 6   petal_width     150 non-null    float64
dtypes: float64(4), int64(2), object(1)
memory usage: 8.3+ KB

In [527]:
iris_df.describe()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width
count,150.000000,150.000000,150.000000,150.000000,150.000000,150.000000
mean,2.000000,75.500000,5.843333,3.057333,3.758000,1.199333
std,0.819232,43.445368,0.828066,0.435866,1.765298,0.762238
min,1.000000,1.000000,4.300000,2.000000,1.000000,0.100000
25%,1.000000,38.250000,5.100000,2.800000,1.600000,0.300000
50%,2.000000,75.500000,5.800000,3.000000,4.350000,1.300000
75%,3.000000,112.750000,6.400000,3.300000,5.100000,1.800000
max,3.000000,150.000000,7.900000,4.400000,6.900000,2.500000

In [528]:
iris_df.drop(columns = ['species_id', 'measurement_id'], inplace=True)

In [529]:
iris_df.head()

  species_name  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2
3       setosa           4.6          3.1           1.5          0.2
4       setosa           5.0          3.6           1.4          0.2

In [530]:
iris_df.rename(columns={'species_name': 'species'}, inplace=True)

In [531]:
iris_df.head()

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2
3  setosa           4.6          3.1           1.5          0.2
4  setosa           5.0          3.6           1.4          0.2

In [532]:
dummies = pd.get_dummies(iris_df['species'])
dummies.head()

   setosa  versicolor  virginica
0       1           0          0
1       1           0          0
2       1           0          0
3       1           0          0
4       1           0          0

In [533]:
dummies = pd.get_dummies(iris_df['species'], drop_first=True)
dummies.head()

   versicolor  virginica
0           0          0
1           0          0
2           0          0
3           0          0
4           0          0

In [534]:
iris_df = pd.concat([iris_df, dummies], axis=1)

In [535]:
iris_df.head()

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,0,0
1,setosa,4.9,3.0,1.4,0.2,0,0
2,setosa,4.7,3.2,1.3,0.2,0,0
3,setosa,4.6,3.1,1.5,0.2,0,0
4,setosa,5.0,3.6,1.4,0.2,0,0

In [536]:
def prep_iris(df):
    df.drop(columns = ['species_id', 'measurement_id'], inplace=True)
    df.rename(columns={'species_name': 'species'}, inplace=True)
    dummies = pd.get_dummies(iris_df['species'], drop_first=True)
    df = pd.concat([df, dummies], axis=1)
    return df

In [537]:
test_iris = acquire.get_iris_data()
test_iris.head()

,species_id,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,1,5.1,3.5,1.4,0.2
1,1,setosa,2,4.9,3.0,1.4,0.2
2,1,setosa,3,4.7,3.2,1.3,0.2
3,1,setosa,4,4.6,3.1,1.5,0.2
4,1,setosa,5,5.0,3.6,1.4,0.2

In [538]:
clean_iris = prep_iris(test_iris)
clean_iris.head()

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,0,0
1,setosa,4.9,3.0,1.4,0.2,0,0
2,setosa,4.7,3.2,1.3,0.2,0,0
3,setosa,4.6,3.1,1.5,0.2,0,0
4,setosa,5.0,3.6,1.4,0.2,0,0

In [539]:
titanic_df = acquire.get_titanic_data()

In [540]:
titanic_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [541]:
titanic_df.shape

(891, 13)

In [542]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  891 non-null    int64
 1   survived      891 non-null    int64
 2   pclass        891 non-null    int64
 3   sex           891 non-null    object
 4   age           714 non-null    float64
 5   sibsp         891 non-null    int64
 6   parch         891 non-null    int64
 7   fare          891 non-null    float64
 8   embarked      889 non-null    object
 9   class         891 non-null    object
 10  deck          203 non-null    object
 11  embark_town   889 non-null    object
 12  alone         891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [543]:
titanic_df.isna().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          2
class             0
deck            688
embark_town       2
alone             0
dtype: int64

In [544]:
titanic_df.drop(columns = ['class', 'embarked','deck', 'passenger_id', 'age'], inplace=True )

In [545]:
titanic_df.head()

   survived  pclass     sex  sibsp  parch     fare  embark_town  alone
0         0       3    male      1      0   7.2500  Southampton      0
1         1       1  female      1      0  71.2833    Cherbourg      0
2         1       3  female      0      0   7.9250  Southampton      1
3         1       1  female      1      0  53.1000  Southampton      0
4         0       3    male      0      0   8.0500  Southampton      1

In [546]:
titanic_df['embark_town'].fillna('Southampton', inplace=True)

In [547]:
dummies = pd.get_dummies(titanic_df[['sex', 'embark_town']], drop_first=True)
dummies

     sex_male  embark_town_Queenstown  embark_town_Southampton
0           1                       0                        1
1           0                       0                        0
2           0                       0                        1
3           0                       0                        1
4           1                       0                        1
..        ...                     ...                      ...
886         1                       0                        1
887         0                       0                        1
888         0                       0                        1
889         1                       0                        0
890         1                       1                        0

[891 rows x 3 columns]

In [548]:
titanic_df = pd.concat([titanic_df, dummies],axis=1)
titanic_df

,survived,pclass,sex,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,3,male,1,0,7.2500,Southampton,0,1,0,1
1,1,1,female,1,0,71.2833,Cherbourg,0,0,0,0
2,1,3,female,0,0,7.9250,Southampton,1,0,0,1
3,1,1,female,1,0,53.1000,Southampton,0,0,0,1
4,0,3,male,0,0,8.0500,Southampton,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,0,0,13.0000,Southampton,1,1,0,1
887,1,1,female,0,0,30.0000,Southampton,1,0,0,1
888,0,3,female,1,2,23.4500,Southampton,0,0,0,1
889,1,1,male,0,0,30.0000,Cherbourg,1,1,0,0
890,0,3,male,0,0,7.7500,Queenstown,1,1,1,0

In [549]:
def prep_titanic(df):
    
    df.drop(columns = ['class', 'embarked','deck', 'passenger_id', 'age'], inplace=True )
    
    df['embark_town'].fillna('Southampton', inplace=True)
    
    dummies = pd.get_dummies(df[['sex', 'embark_town']], drop_first=True)
    
    df = pd.concat([df, dummies],axis=1)

    return df

In [550]:
test_titanic = acquire.get_titanic_data()
test_titanic

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,NaN,Southampton,1
887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
888,888,0,3,female,NaN,1,2,23.4500,S,Third,NaN,Southampton,0
889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,NaN,Queenstown,1

In [551]:
clean_titanic = prep_titanic(test_titanic)
clean_titanic

,survived,pclass,sex,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,3,male,1,0,7.2500,Southampton,0,1,0,1
1,1,1,female,1,0,71.2833,Cherbourg,0,0,0,0
2,1,3,female,0,0,7.9250,Southampton,1,0,0,1
3,1,1,female,1,0,53.1000,Southampton,0,0,0,1
4,0,3,male,0,0,8.0500,Southampton,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,0,0,13.0000,Southampton,1,1,0,1
887,1,1,female,0,0,30.0000,Southampton,1,0,0,1
888,0,3,female,1,2,23.4500,Southampton,0,0,0,1
889,1,1,male,0,0,30.0000,Cherbourg,1,1,0,0
890,0,3,male,0,0,7.7500,Queenstown,1,1,1,0

In [552]:
telco_df = acquire.get_telco_data()

In [553]:
telco_df.head()

,payment_type_id,contract_type_id,internet_service_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,internet_service_type,contract_type,payment_type
0,2,2,1,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,DSL,One year,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,DSL,Month-to-month,Mailed check
2,1,1,2,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Fiber optic,Month-to-month,Electronic check
3,1,1,2,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Fiber optic,Month-to-month,Electronic check
4,2,1,2,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Fiber optic,Month-to-month,Mailed check

In [554]:
telco_df.shape

(7043, 24)

In [555]:
telco_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 24 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   payment_type_id           7043 non-null   int64
 1   contract_type_id          7043 non-null   int64
 2   internet_service_type_id  7043 non-null   int64
 3   customer_id               7043 non-null   object
 4   gender                    7043 non-null   object
 5   senior_citizen            7043 non-null   int64
 6   partner                   7043 non-null   object
 7   dependents                7043 non-null   object
 8   tenure                    7043 non-null   int64
 9   phone_service             7043 non-null   object
 10  multiple_lines            7043 non-null   object
 11  online_security           7043 non-null   object
 12  online_backup             7043 non-null   object
 13  device_protection         7043 non-null   object
 14  tech_support              7043 non-null   object
 15  streaming_tv              7043 non-null   object
 16  streaming_movies          7043 non-null   object
 17  paperless_billing         7043 non-null   object
 18  monthly_charges           7043 non-null   float64
 19  total_charges             7043 non-null   object
 20  churn                     7043 non-null   object
 21  internet_service_type     7043 non-null   object
 22  contract_type             7043 non-null   object
 23  payment_type              7043 non-null   object
dtypes: float64(1), int64(5), object(18)
memory usage: 1.3+ MB

In [556]:
telco_df.describe()

,payment_type_id,contract_type_id,internet_service_type_id,senior_citizen,tenure,monthly_charges
count,7043.000000,7043.000000,7043.000000,7043.000000,7043.000000,7043.000000
mean,2.315633,1.690473,1.872923,0.162147,32.371149,64.761692
std,1.148907,0.833755,0.737796,0.368612,24.559481,30.090047
min,1.000000,1.000000,1.000000,0.000000,0.000000,18.250000
25%,1.000000,1.000000,1.000000,0.000000,9.000000,35.500000
50%,2.000000,1.000000,2.000000,0.000000,29.000000,70.350000
75%,3.000000,2.000000,2.000000,0.000000,55.000000,89.850000
max,4.000000,3.000000,3.000000,1.000000,72.000000,118.750000

In [557]:
telco_df.head()

,payment_type_id,contract_type_id,internet_service_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,internet_service_type,contract_type,payment_type
0,2,2,1,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,DSL,One year,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,DSL,Month-to-month,Mailed check
2,1,1,2,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Fiber optic,Month-to-month,Electronic check
3,1,1,2,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Fiber optic,Month-to-month,Electronic check
4,2,1,2,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Fiber optic,Month-to-month,Mailed check

In [558]:
to_drop = ['payment_type_id', 'contract_type_id', 'internet_service_type_id','customer_id' ]

In [559]:
telco_df.drop(columns = to_drop, inplace=True)

In [560]:
telco_df.head()

,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,internet_service_type,contract_type,payment_type
0,Female,0,Yes,Yes,9,Yes,No,No,Yes,No,Yes,Yes,No,Yes,65.6,593.3,No,DSL,One year,Mailed check
1,Male,0,No,No,9,Yes,Yes,No,No,No,No,No,Yes,No,59.9,542.4,No,DSL,Month-to-month,Mailed check
2,Male,0,No,No,4,Yes,No,No,No,Yes,No,No,No,Yes,73.9,280.85,Yes,Fiber optic,Month-to-month,Electronic check
3,Male,1,Yes,No,13,Yes,No,No,Yes,Yes,No,Yes,Yes,Yes,98.0,1237.85,Yes,Fiber optic,Month-to-month,Electronic check
4,Female,1,Yes,No,3,Yes,No,No,No,No,Yes,Yes,No,Yes,83.9,267.4,Yes,Fiber optic,Month-to-month,Mailed check

In [561]:
to_dummies = ['gender', 'partner', 'dependents', 'phone_service', 'multiple_lines', 'online_security', 'online_backup', 'device_protection', 'tech_support', 'streaming_tv', 'streaming_movies', 'paperless_billing', 'churn', 'internet_service_type', 'contract_type', 'payment_type']

In [562]:
dummies = pd.get_dummies(telco_df[to_dummies],drop_first=True)
dummies

,gender_Male,partner_Yes,dependents_Yes,phone_service_Yes,multiple_lines_No phone service,multiple_lines_Yes,online_security_No internet service,online_security_Yes,online_backup_No internet service,online_backup_Yes,...,streaming_movies_Yes,paperless_billing_Yes,churn_Yes,internet_service_type_Fiber optic,internet_service_type_None,contract_type_One year,contract_type_Two year,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,0,1,1,1,0,0,0,0,0,1,...,0,1,0,0,0,1,0,0,0,1
1,1,0,0,1,0,1,0,0,0,0,...,1,0,0,0,0,0,0,0,0,1
2,1,0,0,1,0,0,0,0,0,0,...,0,1,1,1,0,0,0,0,1,0
3,1,1,0,1,0,0,0,0,0,1,...,1,1,1,1,0,0,0,0,1,0
4,0,1,0,1,0,0,0,0,0,0,...,0,1,1,1,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,0,0,0,1,0,0,0,1,0,0,...,0,0,0,0,0,1,0,0,0,1
7039,1,1,0,1,0,1,0,0,0,0,...,1,1,1,1,0,0,0,0,1,0
7040,1,0,0,1,0,0,0,0,0,1,...,0,1,0,0,0,0,0,0,0,1
7041,1,1,1,1,0,0,0,1,0,0,...,1,0,0,0,0,0,1,0,0,1
7042,1,1,1,0,1,0,0,1,0,1,...,1,0,0,0,0,0,1,0,1,0

In [563]:
telco_df = pd.concat([telco_df, dummies], axis=1)

In [564]:
telco_df

,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,...,streaming_movies_Yes,paperless_billing_Yes,churn_Yes,internet_service_type_Fiber optic,internet_service_type_None,contract_type_One year,contract_type_Two year,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,Female,0,Yes,Yes,9,Yes,No,No,Yes,No,...,0,1,0,0,0,1,0,0,0,1
1,Male,0,No,No,9,Yes,Yes,No,No,No,...,1,0,0,0,0,0,0,0,0,1
2,Male,0,No,No,4,Yes,No,No,No,Yes,...,0,1,1,1,0,0,0,0,1,0
3,Male,1,Yes,No,13,Yes,No,No,Yes,Yes,...,1,1,1,1,0,0,0,0,1,0
4,Female,1,Yes,No,3,Yes,No,No,No,No,...,0,1,1,1,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,Female,0,No,No,13,Yes,No,Yes,No,No,...,0,0,0,0,0,1,0,0,0,1
7039,Male,0,Yes,No,22,Yes,Yes,No,No,No,...,1,1,1,1,0,0,0,0,1,0
7040,Male,0,No,No,2,Yes,No,No,Yes,No,...,0,1,0,0,0,0,0,0,0,1
7041,Male,0,Yes,Yes,67,Yes,No,Yes,No,Yes,...,1,0,0,0,0,0,1,0,0,1
7042,Male,0,Yes,Yes,63,No,No phone service,Yes,Yes,Yes,...,1,0,0,0,0,0,1,0,1,0

In [565]:
def prep_telco(df):
    to_drop = ['payment_type_id', 'contract_type_id', 'internet_service_type_id','customer_id' ]   
    df.drop(columns = to_drop, inplace=True)

    to_dummies = ['gender', 'partner', 'dependents', 'phone_service', 'multiple_lines', 'online_security', 'online_backup', 'device_protection', 'tech_support', 'streaming_tv', 'streaming_movies', 'paperless_billing', 'churn', 'internet_service_type', 'contract_type', 'payment_type']
    dummies = pd.get_dummies(df[to_dummies],drop_first=True)
    
    df = pd.concat([df, dummies],axis=1)

    return df

In [566]:
test_telco = acquire.get_telco_data()
test_telco

,payment_type_id,contract_type_id,internet_service_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,internet_service_type,contract_type,payment_type
0,2,2,1,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.60,593.3,No,DSL,One year,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.90,542.4,No,DSL,Month-to-month,Mailed check
2,1,1,2,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.90,280.85,Yes,Fiber optic,Month-to-month,Electronic check
3,1,1,2,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.00,1237.85,Yes,Fiber optic,Month-to-month,Electronic check
4,2,1,2,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.90,267.4,Yes,Fiber optic,Month-to-month,Mailed check
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,2,2,1,9987-LUTYD,Female,0,No,No,13,Yes,...,Yes,No,No,No,55.15,742.9,No,DSL,One year,Mailed check
7039,1,1,2,9992-RRAMN,Male,0,Yes,No,22,Yes,...,No,No,Yes,Yes,85.10,1873.7,Yes,Fiber optic,Month-to-month,Electronic check
7040,2,1,1,9992-UJOEL,Male,0,No,No,2,Yes,...,No,No,No,Yes,50.30,92.75,No,DSL,Month-to-month,Mailed check
7041,2,3,1,9993-LHIEB,Male,0,Yes,Yes,67,Yes,...,Yes,No,Yes,No,67.85,4627.65,No,DSL,Two year,Mailed check
7042,1,3,1,9995-HOTOH,Male,0,Yes,Yes,63,No,...,No,Yes,Yes,No,59.00,3707.6,No,DSL,Two year,Electronic check

In [567]:
clean_telco = prep_telco(test_telco)
clean_telco

,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,...,streaming_movies_Yes,paperless_billing_Yes,churn_Yes,internet_service_type_Fiber optic,internet_service_type_None,contract_type_One year,contract_type_Two year,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,Female,0,Yes,Yes,9,Yes,No,No,Yes,No,...,0,1,0,0,0,1,0,0,0,1
1,Male,0,No,No,9,Yes,Yes,No,No,No,...,1,0,0,0,0,0,0,0,0,1
2,Male,0,No,No,4,Yes,No,No,No,Yes,...,0,1,1,1,0,0,0,0,1,0
3,Male,1,Yes,No,13,Yes,No,No,Yes,Yes,...,1,1,1,1,0,0,0,0,1,0
4,Female,1,Yes,No,3,Yes,No,No,No,No,...,0,1,1,1,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,Female,0,No,No,13,Yes,No,Yes,No,No,...,0,0,0,0,0,1,0,0,0,1
7039,Male,0,Yes,No,22,Yes,Yes,No,No,No,...,1,1,1,1,0,0,0,0,1,0
7040,Male,0,No,No,2,Yes,No,No,Yes,No,...,0,1,0,0,0,0,0,0,0,1
7041,Male,0,Yes,Yes,67,Yes,No,Yes,No,Yes,...,1,0,0,0,0,0,1,0,0,1
7042,Male,0,Yes,Yes,63,No,No phone service,Yes,Yes,Yes,...,1,0,0,0,0,0,1,0,1,0

In [568]:
iris_df.head()

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,0,0
1,setosa,4.9,3.0,1.4,0.2,0,0
2,setosa,4.7,3.2,1.3,0.2,0,0
3,setosa,4.6,3.1,1.5,0.2,0,0
4,setosa,5.0,3.6,1.4,0.2,0,0

In [569]:
seed = 42

train_iris, test_iris = train_test_split(iris_df, train_size=0.7, random_state=seed, stratify=iris_df['versicolor'])

In [570]:
train_iris.shape, test_iris.shape

((105, 7), (45, 7))

In [571]:
iris_df.head()

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,0,0
1,setosa,4.9,3.0,1.4,0.2,0,0
2,setosa,4.7,3.2,1.3,0.2,0,0
3,setosa,4.6,3.1,1.5,0.2,0,0
4,setosa,5.0,3.6,1.4,0.2,0,0

In [572]:
seed = 42

train_iris, val_test_iris = train_test_split(iris_df, train_size=0.7, random_state=seed, stratify=iris_df['versicolor'])

In [573]:
validate_iris, test_iris = train_test_split(val_test_iris, train_size=0.5, random_state=seed, stratify=val_test_iris['versicolor'])

In [574]:
def iris_train_val_test(df):
    seed = 42
    
    train_iris, test_iris = train_test_split(iris_df, train_size=0.7, random_state=seed, stratify=iris_df['versicolor'])

    train_iris, val_test_iris = train_test_split(iris_df, train_size=0.7, random_state=seed, stratify=iris_df['versicolor'])
   
    validate_iris, test_iris = train_test_split(val_test_iris, train_size=0.5, random_state=seed, stratify=val_test_iris['versicolor'])

    
    return train_iris, validate_iris, test_iris

In [575]:
iris_train_val_test(iris_df)

(        species  sepal_length  sepal_width  petal_length  petal_width  \
 46       setosa           5.1          3.8           1.6          0.2
 19       setosa           5.1          3.8           1.5          0.3
 0        setosa           5.1          3.5           1.4          0.2
 93   versicolor           5.0          2.3           3.3          1.0
 25       setosa           5.0          3.0           1.6          0.2
 95   versicolor           5.7          3.0           4.2          1.2
 105   virginica           7.6          3.0           6.6          2.1
 127   virginica           6.1          3.0           4.9          1.8
 33       setosa           5.5          4.2           1.4          0.2
 52   versicolor           6.9          3.1           4.9          1.5
 60   versicolor           5.0          2.0           3.5          1.0
 28       setosa           5.2          3.4           1.4          0.2
 130   virginica           7.4          2.8           6.1          1.9
 111   virginica           6.4          2.7           5.3          1.9
 131   virginica           7.9          3.8           6.4          2.0
 75   versicolor           6.6          3.0           4.4          1.4
 22       setosa           4.6          3.6           1.0          0.2
 11       setosa           4.8          3.4           1.6          0.2
 94   versicolor           5.6          2.7           4.2          1.3
 128   virginica           6.4          2.8           5.6          2.1
 119   virginica           6.0          2.2           5.0          1.5
 73   versicolor           6.1          2.8           4.7          1.2
 55   versicolor           5.7          2.8           4.5          1.3
 72   versicolor           6.3          2.5           4.9          1.5
 16       setosa           5.4          3.9           1.3          0.4
 4        setosa           5.0          3.6           1.4          0.2
 143   virginica           6.8          3.2           5.9          2.3
 138   virginica           6.0          3.0           4.8          1.8
 115   virginica           6.4          3.2           5.3          2.3
 49       setosa           5.0          3.3           1.4          0.2
 31       setosa           5.4          3.4           1.5          0.4
 44       setosa           5.1          3.8           1.9          0.4
 118   virginica           7.7          2.6           6.9          2.3
 139   virginica           6.9          3.1           5.4          2.1
 18       setosa           5.7          3.8           1.7          0.3
 45       setosa           4.8          3.0           1.4          0.3
 106   virginica           4.9          2.5           4.5          1.7
 96   versicolor           5.7          2.9           4.2          1.3
 81   versicolor           5.5          2.4           3.7          1.0
 15       setosa           5.7          4.4           1.5          0.4
 78   versicolor           6.0          2.9           4.5          1.5
 12       setosa           4.8          3.0           1.4          0.1
 69   versicolor           5.6          2.5           3.9          1.1
 135   virginica           7.7          3.0           6.1          2.3
 50   versicolor           7.0          3.2           4.7          1.4
 38       setosa           4.4          3.0           1.3          0.2
 26       setosa           5.0          3.4           1.6          0.4
 85   versicolor           6.0          3.4           4.5          1.6
 13       setosa           4.3          3.0           1.1          0.1
 63   versicolor           6.1          2.9           4.7          1.4
 17       setosa           5.1          3.5           1.4          0.3
 126   virginica           6.2          2.8           4.8          1.8
 8        setosa           4.4          2.9           1.4          0.2
 87   versicolor           6.3          2.3           4.4          1.3
 104   virginica           6.5          3.0           5.8          2.2
 53   versicolor           5.5          2.3           4.0          1.3
 103   virginica           6.3          2.9           5.6          1.8
 35       setosa           5.0          3.2           1.2          0.2
 30       setosa           4.8          3.1           1.6          0.2
 100   virginica           6.3          3.3           6.0          2.5
 114   virginica           5.8          2.8           5.1          2.4
 43       setosa           5.0          3.5           1.6          0.6
 59   versicolor           5.2          2.7           3.9          1.4
 112   virginica           6.8          3.0           5.5          2.1
 3        setosa           4.6          3.1           1.5          0.2
 86   versicolor           6.7          3.1           4.7          1.5
 71   versicolor           6.1          2.8           4.0          1.3
 42       setosa           4.4          3.2           1.3          0.2
 70   versicolor           5.9          3.2           4.8          1.8
 24       setosa           4.8          3.4           1.9          0.2
 116   virginica           6.5          3.0           5.5          1.8
 68   versicolor           6.2          2.2           4.5          1.5
 10       setosa           5.4          3.7           1.5          0.2
 65   versicolor           6.7          3.1           4.4          1.4
 99   versicolor           5.7          2.8           4.1          1.3
 147   virginica           6.5          3.0           5.2          2.0
 120   virginica           6.9          3.2           5.7          2.3
 67   versicolor           5.8          2.7           4.1          1.0
 62   versicolor           6.0          2.2           4.0          1.0
 40       setosa           5.0          3.5           1.3          0.3
 133   virginica           6.3          2.8           5.1          1.5
 76   versicolor           6.8          2.8           4.8          1.4
 79   versicolor           5.7          2.6           3.5          1.0
 64   versicolor           5.6          2.9           3.6          1.3
 122   virginica           7.7          2.8           6.7          2.0
 92   versicolor           5.8          2.6           4.0          1.2
 145   virginica           6.7          3.0           5.2          2.3
 74   versicolor           6.4          2.9           4.3          1.3
 80   versicolor           5.5          2.4           3.8          1.1
 39       setosa           5.1          3.4           1.5          0.2
 6        setosa           4.6          3.4           1.4          0.3
 149   virginica           5.9          3.0           5.1          1.8
 27       setosa           5.2          3.5           1.5          0.2
 34       setosa           4.9          3.1           1.5          0.2
 117   virginica           7.7          3.8           6.7          2.2
 146   virginica           6.3          2.5           5.0          1.9
 89   versicolor           5.5          2.5           4.0          1.3
 36       setosa           5.5          3.5           1.3          0.2
 51   versicolor           6.4          3.2           4.5          1.5
 47       setosa           4.6          3.2           1.4          0.2
 123   virginica           6.3          2.7           4.9          1.8
 5        setosa           5.4          3.9           1.7          0.4
 9        setosa           4.9          3.1           1.5          0.1
 7        setosa           5.0          3.4           1.5          0.2
 140   virginica           6.7          3.1           5.6          2.4

      versicolor  virginica
 46            0          0
 19            0          0
 0             0          0
 93            1          0
 25            0          0
 95            1          0
 105           0          1
 127           0          1
 33            0          0
 52            1          0
 60            1          0
 28            0          0
 130           0          1
 111           0          1
 131           0          1
 75            1          0
 22            0          0
 11            0          0
 94            1          0
 128           0          1
 119           0          1
 73            1          0
 55            1          0
 72            1          0
 16            0          0
 4             0          0
 143           0          1
 138           0          1
 115           0          1
 49            0          0
 31            0          0
 44            0          0
 118           0          1
 139           0          1
 18            0          0
 45            0          0
 106           0          1
 96            1          0
 81            1          0
 15            0          0
 78            1          0
 12            0          0
 69            1          0
 135           0          1
 50            1          0
 38            0          0
 26            0          0
 85            1          0
 13            0          0
 63            1          0
 17            0          0
 126           0          1
 8             0          0
 87            1          0
 104           0          1
 53            1          0
 103           0          1
 35            0          0
 30            0          0
 100           0          1
 114           0          1
 43            0          0
 59            1          0
 112           0          1
 3             0          0
 86            1          0
 71            1          0
 42            0          0
 70            1          0
 24            0          0
 116           0          1
 68            1          0
 10            0          0
 65            1          0
 99            1          0
 147           0          1
 120           0          1
 67            1          0
 62            1          0
 40            0          0
 133           0          1
 76            1          0
 79            1          0
 64            1          0
 122           0          1
 92            1          0
 145           0          1
 74            1          0
 80            1          0
 39            0          0
 6             0          0
 149           0          1
 27            0          0
 34            0          0
 117           0          1
 146           0          1
 89            1          0
 36            0          0
 51            1          0
 47            0          0
 123           0          1
 5             0          0
 9             0          0
 7             0          0
 140           0          1  ,
         species  sepal_length  sepal_width  petal_length  petal_width  \
 109   virginica           7.2          3.6           6.1          2.5
 141   virginica           6.9          3.1           5.1          2.3
 136   virginica           6.3          3.4           5.6          2.4
 83   versicolor           6.0          2.7           5.1          1.6
 107   virginica           7.3          2.9           6.3          1.8
 98   versicolor           5.1          2.5           3.0          1.1
 57   versicolor           4.9          2.4           3.3          1.0
 84   versicolor           5.4          3.0           4.5          1.5
 91   versicolor           6.1          3.0           4.6          1.4
 102   virginica           7.1          3.0           5.9          2.1
 134   virginica           6.1          2.6           5.6          1.4
 129   virginica           7.2          3.0           5.8          1.6
 37       setosa           4.9          3.6           1.4          0.1
 97   versicolor           6.2          2.9           4.3          1.3
 125   virginica           7.2          3.2           6.0          1.8
 124   virginica           6.7          3.3           5.7          2.1
 32       setosa           5.2          4.1           1.5          0.1
 14       setosa           5.8          4.0           1.2          0.2
 21       setosa           5.1          3.7           1.5          0.4
 58   versicolor           6.6          2.9           4.6          1.3
 113   virginica           5.7          2.5           5.0          2.0
 132   virginica           6.4          2.8           5.6          2.2

      versicolor  virginica
 109           0          1
 141           0          1
 136           0          1
 83            1          0
 107           0          1
 98            1          0
 57            1          0
 84            1          0
 91            1          0
 102           0          1
 134           0          1
 129           0          1
 37            0          0
 97            1          0
 125           0          1
 124           0          1
 32            0          0
 14            0          0
 21            0          0
 58            1          0
 113           0          1
 132           0          1  ,
         species  sepal_length  sepal_width  petal_length  petal_width  \
 2        setosa           4.7          3.2           1.3          0.2
 148   virginica           6.2          3.4           5.4          2.3
 144   virginica           6.7          3.3           5.7          2.5
 66   versicolor           5.6          3.0           4.5          1.5
 142   virginica           5.8          2.7           5.1          1.9
 56   versicolor           6.3          3.3           4.7          1.6
 29       setosa           4.7          3.2           1.6          0.2
 77   versicolor           6.7          3.0           5.0          1.7
 121   virginica           5.6          2.8           4.9          2.0
 54   versicolor           6.5          2.8           4.6          1.5
 101   virginica           5.8          2.7           5.1          1.9
 82   versicolor           5.8          2.7           3.9          1.2
 110   virginica           6.5          3.2           5.1          2.0
 88   versicolor           5.6          3.0           4.1          1.3
 137   virginica           6.4          3.1           5.5          1.8
 1        setosa           4.9          3.0           1.4          0.2
 61   versicolor           5.9          3.0           4.2          1.5
 108   virginica           6.7          2.5           5.8          1.8
 41       setosa           4.5          2.3           1.3          0.3
 23       setosa           5.1          3.3           1.7          0.5
 20       setosa           5.4          3.4           1.7          0.2
 48       setosa           5.3          3.7           1.5          0.2
 90   versicolor           5.5          2.6           4.4          1.2

      versicolor  virginica
 2             0          0
 148           0          1
 144           0          1
 66            1          0
 142           0          1
 56            1          0
 29            0          0
 77            1          0
 121           0          1
 54            1          0
 101           0          1
 82            1          0
 110           0          1
 88            1          0
 137           0          1
 1             0          0
 61            1          0
 108           0          1
 41            0          0
 23            0          0
 20            0          0
 48            0          0
 90            1          0  )

In [576]:
titanic_df.head()

,survived,pclass,sex,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,3,male,1,0,7.2500,Southampton,0,1,0,1
1,1,1,female,1,0,71.2833,Cherbourg,0,0,0,0
2,1,3,female,0,0,7.9250,Southampton,1,0,0,1
3,1,1,female,1,0,53.1000,Southampton,0,0,0,1
4,0,3,male,0,0,8.0500,Southampton,1,1,0,1

In [577]:
seed = 42

train_titanic, test_titanic = train_test_split(titanic_df, train_size=0.7, random_state=seed, stratify=titanic_df['survived'])

In [578]:
train_titanic.shape, test_titanic.shape

((623, 11), (268, 11))

In [579]:
train_titanic.head()

,survived,pclass,sex,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
748,0,1,male,1,0,53.1000,Southampton,0,1,0,1
45,0,3,male,0,0,8.0500,Southampton,1,1,0,1
28,1,3,female,0,0,7.8792,Queenstown,1,0,1,0
633,0,1,male,0,0,0.0000,Southampton,1,1,0,1
403,0,3,male,1,0,15.8500,Southampton,0,1,0,1

In [580]:
seed = 42

train_titanic, val_test_titanic = train_test_split(titanic_df, train_size=0.7, random_state=seed, stratify=titanic_df['survived'])

In [581]:
validate_titanic, test_titanic = train_test_split(val_test_titanic, train_size=0.5, random_state=seed, stratify=val_test_titanic['survived'])

In [582]:
def titanic_train_val_test(df):
    seed = 42
    
    train_titanic, test_titanic = train_test_split(titanic_df, train_size=0.7, random_state=seed, stratify=titanic_df['survived'])

    train_titanic, val_test_titanic = train_test_split(titanic_df, train_size=0.7, random_state=seed, stratify=titanic_df['survived'])

    validate_titanic, test_titanic = train_test_split(val_test_titanic, train_size=0.5, random_state=seed, stratify=val_test_titanic['survived'])

    
    return train_titanic, validate_titanic, test_titanic

In [583]:
titanic_train_val_test(titanic_df)

(     survived  pclass     sex  sibsp  parch     fare  embark_town  alone  \
 748         0       1    male      1      0  53.1000  Southampton      0
 45          0       3    male      0      0   8.0500  Southampton      1
 28          1       3  female      0      0   7.8792   Queenstown      1
 633         0       1    male      0      0   0.0000  Southampton      1
 403         0       3    male      1      0  15.8500  Southampton      0
 ..        ...     ...     ...    ...    ...      ...          ...    ...
 476         0       2    male      1      0  21.0000  Southampton      0
 190         1       2  female      0      0  13.0000  Southampton      1
 736         0       3  female      1      3  34.3750  Southampton      0
 462         0       1    male      0      0  38.5000  Southampton      1
 136         1       1  female      0      2  26.2833  Southampton      0

      sex_male  embark_town_Queenstown  embark_town_Southampton
 748         1                       0                        1
 45          1                       0                        1
 28          0                       1                        0
 633         1                       0                        1
 403         1                       0                        1
 ..        ...                     ...                      ...
 476         1                       0                        1
 190         0                       0                        1
 736         0                       0                        1
 462         1                       0                        1
 136         0                       0                        1

 [623 rows x 11 columns],
      survived  pclass     sex  sibsp  parch      fare  embark_town  alone  \
 377         0       1    male      0      2  211.5000    Cherbourg      0
 244         0       3    male      0      0    7.2250    Cherbourg      1
 72          0       2    male      0      0   73.5000  Southampton      1
 815         0       1    male      0      0    0.0000  Southampton      1
 841         0       2    male      0      0   10.5000  Southampton      1
 23          1       1    male      0      0   35.5000  Southampton      1
 27          0       1    male      3      2  263.0000  Southampton      0
 239         0       2    male      0      0   12.2750  Southampton      1
 386         0       3    male      5      2   46.9000  Southampton      0
 347         1       3  female      1      0   16.1000  Southampton      0
 138         0       3    male      0      0    9.2167  Southampton      1
 759         1       1  female      0      0   86.5000  Southampton      1
 792         0       3  female      8      2   69.5500  Southampton      0
 726         1       2  female      3      0   21.0000  Southampton      0
 558         1       1  female      1      1   79.6500  Southampton      0
 29          0       3    male      0      0    7.8958  Southampton      1
 824         0       3    male      4      1   39.6875  Southampton      0
 795         0       2    male      0      0   13.0000  Southampton      1
 196         0       3    male      0      0    7.7500   Queenstown      1
 375         1       1  female      1      0   82.1708    Cherbourg      0
 463         0       2    male      0      0   13.0000  Southampton      1
 560         0       3    male      0      0    7.7500   Queenstown      1
 427         1       2  female      0      0   26.0000  Southampton      1
 90          0       3    male      0      0    8.0500  Southampton      1
 578         0       3  female      1      0   14.4583    Cherbourg      0
 442         0       3    male      1      0    7.7750  Southampton      0
 361         0       2    male      1      0   27.7208    Cherbourg      0
 502         0       3  female      0      0    7.6292   Queenstown      1
 735         0       3    male      0      0   16.1000  Southampton      1
 836         0       3    male      0      0    8.6625  Southampton      1
 165         1       3    male      0      2   20.5250  Southampton      0
 676         0       3    male      0      0    8.0500  Southampton      1
 352         0       3    male      1      1    7.2292    Cherbourg      0
 211         1       2  female      0      0   21.0000  Southampton      1
 336         0       1    male      1      0   66.6000  Southampton      0
 321         0       3    male      0      0    7.8958  Southampton      1
 484         1       1    male      1      0   91.0792    Cherbourg      0
 625         0       1    male      0      0   32.3208  Southampton      1
 279         1       3  female      1      1   20.2500  Southampton      0
 669         1       1  female      1      0   52.0000  Southampton      0
 106         1       3  female      0      0    7.6500  Southampton      1
 371         0       3    male      1      0    6.4958  Southampton      0
 71          0       3  female      5      2   46.9000  Southampton      0
 732         0       2    male      0      0    0.0000  Southampton      1
 526         1       2  female      0      0   10.5000  Southampton      1
 380         1       1  female      0      0  227.5250    Cherbourg      1
 252         0       1    male      0      0   26.5500  Southampton      1
 614         0       3    male      0      0    8.0500  Southampton      1
 515         0       1    male      0      0   34.0208  Southampton      1
 333         0       3    male      2      0   18.0000  Southampton      0
 82          1       3  female      0      0    7.7875   Queenstown      1
 259         1       2  female      0      1   26.0000  Southampton      0
 643         1       3    male      0      0   56.4958  Southampton      1
 802         1       1    male      1      2  120.0000  Southampton      0
 717         1       2  female      0      0   10.5000  Southampton      1
 714         0       2    male      0      0   13.0000  Southampton      1
 153         0       3    male      0      2   14.5000  Southampton      0
 646         0       3    male      0      0    7.8958  Southampton      1
 411         0       3    male      0      0    6.8583   Queenstown      1
 513         1       1  female      1      0   59.4000    Cherbourg      0
 162         0       3    male      0      0    7.7750  Southampton      1
 423         0       3  female      1      1   14.4000  Southampton      0
 369         1       1  female      0      0   69.3000    Cherbourg      1
 431         1       3  female      1      0   16.1000  Southampton      0
 565         0       3    male      2      0   24.1500  Southampton      0
 397         0       2    male      0      0   26.0000  Southampton      1
 84          1       2  female      0      0   10.5000  Southampton      1
 886         0       2    male      0      0   13.0000  Southampton      1
 433         0       3    male      0      0    7.1250  Southampton      1
 570         1       2    male      0      0   10.5000  Southampton      1
 549         1       2    male      1      1   36.7500  Southampton      0
 532         0       3    male      1      1    7.2292    Cherbourg      0
 685         0       2    male      1      2   41.5792    Cherbourg      0
 485         0       3  female      3      1   25.4667  Southampton      0
 576         1       2  female      0      0   13.0000  Southampton      1
 779         1       1  female      0      1  211.3375  Southampton      0
 410         0       3    male      0      0    7.8958  Southampton      1
 756         0       3    male      0      0    7.7958  Southampton      1
 17          1       2    male      0      0   13.0000  Southampton      1
 166         1       1  female      0      1   55.0000  Southampton      0
 640         0       3    male      0      0    7.8542  Southampton      1
 186         1       3  female      1      0   15.5000   Queenstown      0
 92          0       1    male      1      0   61.1750  Southampton      0
 49          0       3  female      1      0   17.8000  Southampton      0
 592         0       3    male      0      0    7.2500  Southampton      1
 868         0       3    male      0      0    9.5000  Southampton      1
 306         1       1  female      0      0  110.8833    Cherbourg      1
 853         1       1  female      0      1   39.4000  Southampton      0
 683         0       3    male      5      2   46.9000  Southampton      0
 203         0       3    male      0      0    7.2250    Cherbourg      1
 492         0       1    male      0      0   30.5000  Southampton      1
 296         0       3    male      0      0    7.2292    Cherbourg      1
 198         1       3  female      0      0    7.7500   Queenstown      1
 681         1       1    male      0      0   76.7292    Cherbourg      1
 536         0       1    male      0      0   26.5500  Southampton      1
 799         0       3  female      1      1   24.1500  Southampton      0
 11          1       1  female      0      0   26.5500  Southampton      1
 349         0       3    male      0      0    8.6625  Southampton      1
 389         1       2  female      0      0   12.0000    Cherbourg      1
 541         0       3  female      4      2   31.2750  Southampton      0
 277         0       2    male      0      0    0.0000  Southampton      1
 644         1       3  female      2      1   19.2583    Cherbourg      0
 459         0       3    male      0      0    7.7500   Queenstown      1
 435         1       1  female      1      2  120.0000  Southampton      0
 441         0       3    male      0      0    9.5000  Southampton      1
 501         0       3  female      0      0    7.7500   Queenstown      1
 16          0       3    male      4      1   29.1250   Queenstown      0
 65          1       3    male      1      1   15.2458    Cherbourg      0
 212         0       3    male      0      0    7.2500  Southampton      1
 701         1       1    male      0      0   26.2875  Southampton      1
 559         1       3  female      1      0   17.4000  Southampton      0
 430         1       1    male      0      0   26.5500  Southampton      1
 290         1       1  female      0      0   78.8500  Southampton      1
 518         1       2  female      1      0   26.0000  Southampton      0
 666         0       2    male      0      0   13.0000  Southampton      1
 115         0       3    male      0      0    7.9250  Southampton      1
 603         0       3    male      0      0    8.0500  Southampton      1
 275         1       1  female      1      0   77.9583  Southampton      0
 160         0       3    male      0      1   16.1000  Southampton      0
 596         1       2  female      0      0   33.0000  Southampton      1
 340         1       2    male      1      1   26.0000  Southampton      0
 126         0       3    male      0      0    7.7500   Queenstown      1
 39          1       3  female      1      0   11.2417    Cherbourg      0
 555         0       1    male      0      0   26.5500  Southampton      1
 860         0       3    male      2      0   14.1083  Southampton      0
 817         0       2    male      1      1   37.0042    Cherbourg      0
 814         0       3    male      0      0    8.0500  Southampton      1
 205         0       3  female      0      1   10.4625  Southampton      0
 387         1       2  female      0      0   13.0000  Southampton      1
 444         1       3    male      0      0    8.1125  Southampton      1
 764         0       3    male      0      0    7.7750  Southampton      1
 743         0       3    male      1      0   16.1000  Southampton      0
 263         0       1    male      0      0    0.0000  Southampton      1
 730         1       1  female      0      0  211.3375  Southampton      1

      sex_male  embark_town_Queenstown  embark_town_Southampton
 377         1                       0                        0
 244         1                       0                        0
 72          1                       0                        1
 815         1                       0                        1
 841         1                       0                        1
 23          1                       0                        1
 27          1                       0                        1
 239         1                       0                        1
 386         1                       0                        1
 347         0                       0                        1
 138         1                       0                        1
 759         0                       0                        1
 792         0                       0                        1
 726         0                       0                        1
 558         0                       0                        1
 29          1                       0                        1
 824         1                       0                        1
 795         1                       0                        1
 196         1                       1                        0
 375         0                       0                        0
 463         1                       0                        1
 560         1                       1                        0
 427         0                       0                        1
 90          1                       0                        1
 578         0                       0                        0
 442         1                       0                        1
 361         1                       0                        0
 502         0                       1                        0
 735         1                       0                        1
 836         1                       0                        1
 165         1                       0                        1
 676         1                       0                        1
 352         1                       0                        0
 211         0                       0                        1
 336         1                       0                        1
 321         1                       0                        1
 484         1                       0                        0
 625         1                       0                        1
 279         0                       0                        1
 669         0                       0                        1
 106         0                       0                        1
 371         1                       0                        1
 71          0                       0                        1
 732         1                       0                        1
 526         0                       0                        1
 380         0                       0                        0
 252         1                       0                        1
 614         1                       0                        1
 515         1                       0                        1
 333         1                       0                        1
 82          0                       1                        0
 259         0                       0                        1
 643         1                       0                        1
 802         1                       0                        1
 717         0                       0                        1
 714         1                       0                        1
 153         1                       0                        1
 646         1                       0                        1
 411         1                       1                        0
 513         0                       0                        0
 162         1                       0                        1
 423         0                       0                        1
 369         0                       0                        0
 431         0                       0                        1
 565         1                       0                        1
 397         1                       0                        1
 84          0                       0                        1
 886         1                       0                        1
 433         1                       0                        1
 570         1                       0                        1
 549         1                       0                        1
 532         1                       0                        0
 685         1                       0                        0
 485         0                       0                        1
 576         0                       0                        1
 779         0                       0                        1
 410         1                       0                        1
 756         1                       0                        1
 17          1                       0                        1
 166         0                       0                        1
 640         1                       0                        1
 186         0                       1                        0
 92          1                       0                        1
 49          0                       0                        1
 592         1                       0                        1
 868         1                       0                        1
 306         0                       0                        0
 853         0                       0                        1
 683         1                       0                        1
 203         1                       0                        0
 492         1                       0                        1
 296         1                       0                        0
 198         0                       1                        0
 681         1                       0                        0
 536         1                       0                        1
 799         0                       0                        1
 11          0                       0                        1
 349         1                       0                        1
 389         0                       0                        0
 541         0                       0                        1
 277         1                       0                        1
 644         0                       0                        0
 459         1                       1                        0
 435         0                       0                        1
 441         1                       0                        1
 501         0                       1                        0
 16          1                       1                        0
 65          1                       0                        0
 212         1                       0                        1
 701         1                       0                        1
 559         0                       0                        1
 430         1                       0                        1
 290         0                       0                        1
 518         0                       0                        1
 666         1                       0                        1
 115         1                       0                        1
 603         1                       0                        1
 275         0                       0                        1
 160         1                       0                        1
 596         0                       0                        1
 340         1                       0                        1
 126         1                       1                        0
 39          0                       0                        0
 555         1                       0                        1
 860         1                       0                        1
 817         1                       0                        0

In [584]:
telco_df.head()

,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,...,streaming_movies_Yes,paperless_billing_Yes,churn_Yes,internet_service_type_Fiber optic,internet_service_type_None,contract_type_One year,contract_type_Two year,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,Female,0,Yes,Yes,9,Yes,No,No,Yes,No,...,0,1,0,0,0,1,0,0,0,1
1,Male,0,No,No,9,Yes,Yes,No,No,No,...,1,0,0,0,0,0,0,0,0,1
2,Male,0,No,No,4,Yes,No,No,No,Yes,...,0,1,1,1,0,0,0,0,1,0
3,Male,1,Yes,No,13,Yes,No,No,Yes,Yes,...,1,1,1,1,0,0,0,0,1,0
4,Female,1,Yes,No,3,Yes,No,No,No,No,...,0,1,1,1,0,0,0,0,0,1

In [585]:
seed = 42

train_telco, test_telco = train_test_split(telco_df, train_size=0.5, random_state=seed, stratify=telco_df['churn'])

In [586]:
train_telco.shape, test_telco.shape

((3521, 47), (3522, 47))

In [587]:
seed = 42

train_telco, val_test_telco = train_test_split(telco_df, train_size=0.7, random_state=seed, stratify=telco_df['churn'])

In [588]:
validate_telco, test_telco = train_test_split(val_test_telco, train_size=0.5, random_state=seed, stratify=val_test_telco['churn'])

In [589]:
def telco_train_val_test(df):
    seed = 42
    
    train_telco, test_telco = train_test_split(telco_df, train_size=0.5, random_state=seed, stratify=telco_df['churn'])

    train_telco, val_test_telco = train_test_split(telco_df, train_size=0.7, random_state=seed, stratify=telco_df['churn'])

    validate_telco, test_telco = train_test_split(val_test_telco, train_size=0.5, random_state=seed, stratify=val_test_telco['churn'])
    
    return train_telco, validate_telco, test_telco

In [590]:
telco_train_val_test(telco_df)

(      gender  senior_citizen partner dependents  tenure phone_service  \
 5609    Male               0      No         No      14           Yes
 2209    Male               0      No         No       5           Yes
 6919    Male               0     Yes         No      35           Yes
 2284    Male               0     Yes         No      58           Yes
 845   Female               0      No         No       2           Yes
 ...      ...             ...     ...        ...     ...           ...
 4312    Male               0     Yes        Yes      40           Yes
 1501    Male               0     Yes        Yes      52           Yes
 6331  Female               0     Yes        Yes      22           Yes
 2739  Female               0     Yes        Yes      24           Yes
 5679  Female               0      No         No      10           Yes

      multiple_lines      online_security        online_backup  \
 5609             No                   No                   No
 2209             No                   No                   No
 6919            Yes                   No                   No
 2284            Yes                  Yes                  Yes
 845              No                   No                  Yes
 ...             ...                  ...                  ...
 4312            Yes                   No                   No
 1501            Yes  No internet service  No internet service
 6331             No  No internet service  No internet service
 2739            Yes  No internet service  No internet service
 5679             No  No internet service  No internet service

         device_protection  ... streaming_movies_Yes paperless_billing_Yes  \
 5609                  Yes  ...                    0                     0
 2209                  Yes  ...                    1                     1
 6919                   No  ...                    0                     1
 2284                  Yes  ...                    1                     1
 845                    No  ...                    0                     1
 ...                   ...  ...                  ...                   ...
 4312                  Yes  ...                    0                     1
 1501  No internet service  ...                    0                     0
 6331  No internet service  ...                    0                     0
 2739  No internet service  ...                    0                     0
 5679  No internet service  ...                    0                     1

      churn_Yes internet_service_type_Fiber optic  internet_service_type_None  \
 5609         0                                 1                           0
 2209         1                                 0                           0
 6919         1                                 1                           0
 2284         0                                 0                           0
 845          1                                 0                           0
 ...        ...                               ...                         ...
 4312         0                                 1                           0
 1501         0                                 0                           1
 6331         0                                 0                           1
 2739         0                                 0                           1
 5679         0                                 0                           1

      contract_type_One year contract_type_Two year  \
 5609                      0                      0
 2209                      1                      0
 6919                      0                      0
 2284                      0                      1
 845                       0                      0
 ...                     ...                    ...
 4312                      0                      0
 1501                      0                      1
 6331                      1                      0
 2739                      0                      1
 5679                      0                      0

      payment_type_Credit card (automatic) payment_type_Electronic check  \
 5609                                    0                             1
 2209                                    0                             0
 6919                                    0                             1
 2284                                    0                             1
 845                                     0                             0
 ...                                   ...                           ...
 4312                                    0                             1
 1501                                    0                             0
 6331                                    0                             0
 2739                                    0                             0
 5679                                    0                             1

      payment_type_Mailed check
 5609                         0
 2209                         1
 6919                         0
 2284                         0
 845                          1
 ...                        ...
 4312                         0
 1501                         1
 6331                         0
 2739                         1
 5679                         0

 [4930 rows x 47 columns],
       gender  senior_citizen partner dependents  tenure phone_service  \
 6910    Male               0     Yes        Yes      46           Yes
 6044    Male               0     Yes         No      40           Yes
 2153    Male               0     Yes        Yes      53           Yes
 2089    Male               0      No         No      70            No
 6393  Female               0      No         No       3           Yes
 ...      ...             ...     ...        ...     ...           ...
 1521  Female               0     Yes         No       1           Yes
 509   Female               0     Yes        Yes      51           Yes
 2133  Female               0      No         No       1           Yes
 5111  Female               0     Yes        Yes      62           Yes
 6379    Male               0      No         No       3           Yes

         multiple_lines      online_security        online_backup  \
 6910                No  No internet service  No internet service
 6044               Yes                   No                  Yes
 2153               Yes  No internet service  No internet service
 2089  No phone service                   No                   No
 6393               Yes                   No                   No
 ...                ...                  ...                  ...
 1521                No                   No                   No
 509                 No                  Yes                  Yes
 2133                No                   No                   No
 5111               Yes                  Yes                   No
 6379                No  No internet service  No internet service

         device_protection  ... streaming_movies_Yes paperless_billing_Yes  \
 6910  No internet service  ...                    0                     1
 6044                  Yes  ...                    1                     1
 2153  No internet service  ...                    0                     0
 2089                   No  ...                    1                     1
 6393                   No  ...                    1                     1
 ...                   ...  ...                  ...                   ...
 1521                   No  ...                    0                     0
 509                    No  ...                    1                     1
 2133                   No  ...                    1                     1
 5111                   No  ...                    1                     1
 6379  No internet service  ...                    0                     1

      churn_Yes internet_service_type_Fiber optic  internet_service_type_None  \
 6910         0                                 0                           1
 6044         0                                 1                           0
 2153         0                                 0                           1
 2089         0                                 0                           0
 6393         1                                 1                           0
 ...        ...                               ...                         ...
 1521         1                                 0                           0
 509          0                                 0                           0
 2133         1                                 0                           0
 5111         0                                 1                           0
 6379         0                                 0                           1

      contract_type_One year contract_type_Two year  \
 6910                      1                      0
 6044                      1                      0
 2153                      0                      1
 2089                      0                      1
 6393                      0                      0
 ...                     ...                    ...
 1521                      0                      0
 509                       1                      0
 2133                      0                      0
 5111                      0                      1
 6379                      0                      0

      payment_type_Credit card (automatic) payment_type_Electronic check  \
 6910                                    0                             0
 6044                                    0                             0
 2153                                    1                             0
 2089                                    0                             0
 6393                                    0                             1
 ...                                   ...                           ...
 1521                                    0                             0
 509                                     1                             0
 2133                                    0                             1
 5111                                    0                             0
 6379                                    0                             0

      payment_type_Mailed check
 6910                         0
 6044                         0
 2153                         0
 2089                         1
 6393                         0
 ...                        ...
 1521                         1
 509                          0
 2133                         0
 5111                         0
 6379                         1

 [1056 rows x 47 columns],
       gender  senior_citizen partner dependents  tenure phone_service  \
 1628    Male               0      No         No       5           Yes
 3829  Female               0      No         No      38           Yes
 833   Female               0      No         No       4            No
 2956  Female               0      No        Yes      21           Yes
 5446  Female               0     Yes        Yes      36            No
 ...      ...             ...     ...        ...     ...           ...
 6826    Male               0      No         No       5           Yes
 2807  Female               0      No         No       2           Yes
 5885    Male               0      No         No       9           Yes
 5513    Male               0      No        Yes       3           Yes
 4326  Female               0      No         No      26           Yes

         multiple_lines      online_security        online_backup  \
 1628               Yes                   No                  Yes
 3829                No  No internet service  No internet service
 833   No phone service                  Yes                   No
 2956                No                  Yes                   No
 5446  No phone service                  Yes                   No
 ...                ...                  ...                  ...
 6826                No                   No                   No
 2807                No                   No                   No
 5885                No                   No                   No
 5513                No  No internet service  No internet service
 4326               Yes                   No                   No

         device_protection  ... streaming_movies_Yes paperless_billing_Yes  \
 1628                  Yes  ...                    1                     0
 3829  No internet service  ...                    0                     0
 833                   Yes  ...                    1                     0
 2956                  Yes  ...                    1                     0
 5446                  Yes  ...                    0                     0
 ...                   ...  ...                  ...                   ...
 6826                   No  ...                    0                     1
 2807                  Yes  ...                    1                     0
 5885                   No  ...                    0                     1
 5513  No internet service  ...                    0                     0
 4326                  Yes  ...                    0                     1

      churn_Yes internet_service_type_Fiber optic  internet_service_type_None  \
 1628         1                                 1                           0
 3829         0                                 0                           1
 833          0                                 0                           0
 2956         0                                 0                           0
 5446         0                                 0                           0
 ...        ...                               ...                         ...
 6826         0                                 1                           0
 2807         0                                 0                           0
 5885         0                                 1                           0
 5513         0                                 0                           1
 4326         0                                 1                           0

      contract_type_One year contract_type_Two year  \
 1628                      0                      0
 3829                      1                      0
 833                       0                      0
 2956                      1                      0
 5446                      0                      1
 ...                     ...                    ...
 6826                      0                      0
 2807                      0                      0
 5885                      0                      0
 5513                      0                      0
 4326                      0                      0

      payment_type_Credit card (automatic) payment_type_Electronic check  \
 1628                                    0                             0
 3829                                    0                             0
 833                                     0                             0
 2956                                    0                             0
 5446                                    1                             0
 ...                                   ...                           ...
 6826                                    0                             0
 2807                                    0                             1
 5885                                    0                             1
 5513                                    0                             0
 4326                                    0                             1

      payment_type_Mailed check
 1628                         1
 3829                         1
 833                          1
 2956                         1
 5446                         0
 ...                        ...
 6826                         1
 2807                         0
 5885                         0
 5513                         1
 4326                         0

 [1057 rows x 47 columns])